---
kind: enumMember
id: F:Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionErrorCode.IncompleteDefinition
enum: Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionErrorCode
source: html/b4a75bd1-f24d-ea40-2781-f8510ebec5e6.htm
---
# Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionErrorCode.IncompleteDefinition